nxp-mcuxpresso/mcuxsdk-examples/_boards/evkbmimxrt1170/common/pin_mux/pin_mux.h
/* GPIO_EMC_B2_06 (coord T1), SEMC_D22/U25[11] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D22_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D22_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D22_CHANNEL                                 22U   /*!< Signal channel */

/* GPIO_EMC_B2_07 (coord M3), SEMC_D23/U25[13] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D23_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D23_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D23_CHANNEL                                 23U   /*!< Signal channel */

/* GPIO_EMC_B2_08 (coord P1), SEMC_DM2/U25[15] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_DM2_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_DM2_SIGNAL                                   DM   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_DM2_CHANNEL                                  2U   /*!< Signal channel */

/* GPIO_EMC_B2_09 (coord N2), SEMC_D24/U25[42] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D24_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D24_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D24_CHANNEL                                 24U   /*!< Signal channel */

/* GPIO_EMC_B2_10 (coord R2), SEMC_D25/U25[44] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D25_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D25_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D25_CHANNEL                                 25U   /*!< Signal channel */

/* GPIO_EMC_B2_11 (coord L4), SEMC_D26/U25[45] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D26_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D26_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D26_CHANNEL                                 26U   /*!< Signal channel */

/* GPIO_EMC_B2_12 (coord M2), SEMC_D27/U25[47] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D27_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D27_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D27_CHANNEL                                 27U   /*!< Signal channel */

/* GPIO_EMC_B2_13 (coord K5), SEMC_D28/U25[48]/BT_PCM_TXD */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D28_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D28_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D28_CHANNEL                                 28U   /*!< Signal channel */

/* GPIO_EMC_B2_14 (coord M4), SEMC_D29/U25[50] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D29_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D29_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D29_CHANNEL                                 29U   /*!< Signal channel */

/* GPIO_EMC_B2_15 (coord L2), SEMC_D30/U25[51]/BT_PCM_BCLK */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D30_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D30_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D30_CHANNEL                                 30U   /*!< Signal channel */

/* GPIO_EMC_B2_16 (coord P2), SEMC_D31/U25[53]/BT_PCM_SYNC */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_D31_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_D31_SIGNAL                                 DATA   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_D31_CHANNEL                                 31U   /*!< Signal channel */

/* GPIO_EMC_B2_17 (coord T2), SEMC_DM3/U25[39] */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_DM3_PERIPHERAL                             SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_DM3_SIGNAL                                   DM   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_DM3_CHANNEL                                  3U   /*!< Signal channel */

/* GPIO_EMC_B2_18 (coord N3), SEMC_DQS4 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_DQS4_PERIPHERAL                            SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_DQS4_SIGNAL                           semc_dqs4   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void);               /* Function assigned for the Cortex-M7F */

/* GPIO_LPSR_00 (coord N6), CAN3_TX/U42[1]/LPUART12_TXD */
/* Routed pin properties */
#define BOARD_INITCANPINS_CAN3_TX_PERIPHERAL                                CAN3   /*!< Peripheral name */
#define BOARD_INITCANPINS_CAN3_TX_SIGNAL                                      TX   /*!< Signal name */

/* GPIO_LPSR_01 (coord R6), CAN3_RX/U42[4]/LPUART12_RXD */
/* Routed pin properties */
#define BOARD_INITCANPINS_CAN3_RX_PERIPHERAL                                CAN3   /*!< Peripheral name */
#define BOARD_INITCANPINS_CAN3_RX_SIGNAL                                      RX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCANPins(void);                 /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B1_00 (coord B16), SD1_CMD/J15[3]/WIFI_SDIO_CMD/J54[11]/NVCC_SD */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_CMD_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD1_CMD_SIGNAL                              usdhc_cmd   /*!< Signal name */

