nxp-mcuxpresso/mcuxsdk-examples/_boards/evkbmimxrt1170/common/pin_mux/pin_mux.h
/* GPIO_SD_B1_01 (coord D15), SD1_CLK/J15[5]/WIFI_SDIO_CLK/J54[9] */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_CLK_PERIPHERAL                             USDHC1   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD1_CLK_SIGNAL                              usdhc_clk   /*!< Signal name */

/* GPIO_SD_B1_02 (coord C15), SD1_D0/J15[7]/WIFI_SDIO_D0/J54[13]/NVCC_SD */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_D0_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD1_D0_SIGNAL                              usdhc_data   /*!< Signal name */
#define BOARD_INITSDHCPINS_SD1_D0_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_SD_B1_03 (coord B17), SD1_D1/J15[8]/WIFI_SDIO_D1/J54[15] */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_D1_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD1_D1_SIGNAL                              usdhc_data   /*!< Signal name */
#define BOARD_INITSDHCPINS_SD1_D1_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_SD_B1_04 (coord B15), SD1_D2/J15[1]/WIFI_SDIO_D2/J54[17] */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_D2_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD1_D2_SIGNAL                              usdhc_data   /*!< Signal name */
#define BOARD_INITSDHCPINS_SD1_D2_CHANNEL                                     2U   /*!< Signal channel */

/* GPIO_SD_B1_05 (coord A16), SD1_D3/J15[2]/WIFI_SDIO_D3/J54[19] */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD1_D3_PERIPHERAL                              USDHC1   /*!< Peripheral name */
#define BOARD_INITSDHCPINS_SD1_D3_SIGNAL                              usdhc_data   /*!< Signal name */
#define BOARD_INITSDHCPINS_SD1_D3_CHANNEL                                     3U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_SD_B2_05 (coord E14), FlexSPI_A_DQS/U21[C3] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_A_DQS_PERIPHERAL                    FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_A_DQS_SIGNAL                   FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_SD_B2_06 (coord F17), FlexSPI_A_SS0/U23[1]/U21[C2] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_A_SS0_PERIPHERAL                    FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_A_SS0_SIGNAL                 FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_SD_B2_07 (coord G14), FlexSPI_A_CLK/U23[6]/U21[B2] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_A_CLK_PERIPHERAL                    FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_A_CLK_SIGNAL                  FLEXSPI_A_SCLK   /*!< Signal name */

/* GPIO_SD_B2_08 (coord F15), FlexSPI_A_D0/U23[5]/U21[D3] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_A_D0_PERIPHERAL                     FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_A_D0_SIGNAL                  FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B2_09 (coord H15), FlexSPI_A_D1/U23[2]/U21[D2] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_A_D1_PERIPHERAL                     FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_A_D1_SIGNAL                  FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B2_10 (coord H14), FlexSPI_A_D2/U23[3]/U21[C4] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_A_D2_PERIPHERAL                     FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_A_D2_SIGNAL                  FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B2_11 (coord F16), FlexSPI_A_D3/U23[7]/U21[D4] */
/* Routed pin properties */
#define BOARD_INITFLASHPINS_FlexSPI_A_D3_PERIPHERAL                     FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITFLASHPINS_FlexSPI_A_D3_SIGNAL                  FLEXSPI_A_DATA3   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLASHPins(void);               /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
